/* =====================================================================
//! @param		「GameMain」ソース
//! @create		樋口 裕太
//! @date		17/10/12
===================================================================== */

// ヘッダファイルのインクルード
#include "GameMain.h"

// 名前空間
using namespace DirectX;
using namespace DirectX::SimpleMath;
using namespace GucchiLibrary;
using namespace std;

/*==============================================================
// @brief		初期化処理
// @param		なし
// @return		なし
===============================================================*/
void GameMain::Initialize()
{
	// TODO: ゲーム関連の初期化
	text_ = make_unique<Text>(L"Hello World!", WINDOW_MIDDLE);

	// テキスト登録
	textRenderer_.RegisterText(text_.get());
}

/*==============================================================
// @brief		更新処理
// @param		なし
// @return		なし
===============================================================*/
void GameMain::Update()
{
	// TODO: ゲーム関連の更新
}

/*==============================================================
// @brief		描画処理
// @param		なし
// @return		なし
===============================================================*/
void GameMain::Render()
{
	// TODO: ゲーム関連の描画

	// ライブラリインタフェースを用いた描画
	spriteRenderer_.Draw();				// スプライト
	textRenderer_.Draw();				// テキスト
}

/*==============================================================
// @brief		終了処理
// @param		なし
// @return		なし
===============================================================*/
void GameMain::Finalize()
{
	// TODO: ゲーム関連の終了処理
}