/* =====================================================================
//! @param		「Comments」ヘッダ
//! @create		樋口 裕太
//! @date		17/10/30
===================================================================== */

/*
// 関数の説明やヘッダコメントのテンプレートを、
// 他のファイルから持ってきて書き換えるのが面倒な場合
// ここから使ってください
*/


/*
// cpp 用
*/

/* ソースファイルヘッダコメント */

/* =====================================================================
//! @param		「」ソース
//! @create		樋口 裕太
//! @date		17/mm/dd
===================================================================== */


/* 関数コメント */

/*==============================================================
// @brief		なし
// @param		なし
// @return		なし
===============================================================*/


/*
// h 用
*/


/* ヘッダファイルヘッダコメント */

/* =====================================================================
//! @param		「」ヘッダ
//! @create		樋口 裕太
//! @date		17/mm/dd
===================================================================== */


/* クラス宣言コメント */

/*
// @class		xxx クラス
// @content		
// @use			
*/


/* メソッド宣言コメント */

/*
// @method		xxx
// @content		
// @param		
// @return		
*/


/* 列挙型宣言コメント */

/*
// @content		
// @mode		
*/


/* 構造体宣言コメント */

/*
// @struct		xxx 構造体
// @content		
*/