/* =====================================================================
//! @param		「DummyScene」ソース
//! @create		樋口 裕太
//! @date		yy/mm/dd
===================================================================== */

// ヘッダファイルのインクルード
#include "DummyScene.h"

// 名前空間
using namespace GucchiLibrary;

// メンバ関数の定義

/*==============================================================
// @brief		初期化処理
// @param		なし
// @return		なし
===============================================================*/
void DummyScene::Initialize()
{
	// 全シーン共通初期化処理
	IScene::CommonInitialize();
}

/*==============================================================
// @brief		更新処理
// @param		なし
// @return		なし
===============================================================*/
void DummyScene::Update()
{
	// 全シーン共通更新処理
	IScene::CommonUpdate();
}

/*==============================================================
// @brief		描画処理
// @param		なし
// @return		なし
===============================================================*/
void DummyScene::Draw()
{
	// 全シーン共通描画処理
	IScene::CommonDraw();
}

/*==============================================================
// @brief		終了処理
// @param		なし
// @return		なし
===============================================================*/
void DummyScene::Finalize()
{
	// 全シーン共通終了処理
	IScene::CommonFinalize();
}